---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExternalDataTypeService
source: html/67265a68-c9fe-f313-b491-fceadbaca51a.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExternalDataTypeService Property

Unique service id.

## Syntax (C#)
```csharp
public static ExternalServiceId ExternalDataTypeService { get; }
```